Tekla Open API Reference for Tekla Structures 2025
ViewHandler.GetActiveView Method
 Get the current active MDI child window view
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static View GetActiveView()
Public Shared Function GetActiveView As View
Return Value
Type: View
currently active view
See Also
Reference
ViewHandler Class
Tekla.Structures.Model.UI Namespace